Reports/АР17_ОтчетПоНачислениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АР17_ОтчетПоНачислениям</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/АР_РасчетыПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>АР_РасчетыПоДоговорам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ПроведениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР17_ПроведениеДоговораАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР17_ПроведениеДоговораАренды</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_УслугиПоАренде</xr:Item>
				<xr:Item>AccumulationRegister.АР_РасчетыПоДоговорам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документоснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорАренды</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АР17_ОтчетПоНачислениям/Ext/ObjectModule.bsl
Процедура СформироватьОтчетРасшифровка(НастройкиРасшифровки) Экспорт
	
	а=а;
	        //
			//ОтчетРасшифровка = Отчеты.АР_ОтчетПоНачислениям.Создать();
			//Форма = Объект.ПолучитьФорму("ФормаРасшифровка");
			//Форма.Открыть();
			//ОтчетРасшифровка.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
			//ОтчетРасшифровка.СформироватьОтчет();
			//
			
	//МакетСКД = Отчеты.АР_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетРасшифровка = Отчеты.АР17_ОтчетПоНачислениям.ПолучитьМакет("Расшифровка");
	
	КомпоновщикНастроекРасшифровка = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРасшифровка.ЗагрузитьНастройки(МакетРасшифровка.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроекРасшифровка.Настройки;//.ПолучитьНастройки();
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	
	
	//ПараметрСКД = МакетСКД.Параметры.Найти("ВидДокумента");  
	//ПараметрСКД.Значение        = "Счета"; //НачалоПериода;  
	//ПараметрСКД.Использование   = ИспользованиеПараметраКомпоновкиДанных.Всегда; 
	//
	////ПараметрСКД = МакетСКД.Параметры.Найти("КонецПериода");  
	////ПараметрСКД.Значение        = КонецПериода;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////ПараметрСКД = МакетСКД.Параметры.Найти("Организация");  
	////ПараметрСКД.Значение        = Организация;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////МассивГрупп = Новый Массив;
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000120"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000094"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000025"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000110"));

	////ПараметрСКД = МакетСКД.Параметры.Найти("Группа");  
	////ПараметрСКД.Значение        = МассивГрупп;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

    ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// заполняем какие-то параметры
    Настройки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение; //"Счета";
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение;
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетРасшифровка, Настройки, ДанныеРасшифровкиОтчета);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОтчета);

	//ДокументРезультат = Результат;
	//ДокументРезультат.Очистить(); 
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

КонецПроцедуры	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ТабРезультат = Новый ТаблицаЗначений;
    КЧ = Новый КвалификаторыЧисла(12,2);
    КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
    КС = Новый КвалификаторыСтроки(20);
    Массив = Новый Массив;
    Массив.Добавить(Тип("Число"));
    ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
    Массив.Очистить();
    Массив.Добавить(Тип("Дата"));
    ОписаниеТиповД = Новый ОписаниеТипов(Массив, , ,КД);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТабРезультат.Колонки.Добавить("Договор",Новый описаниеТипов("ДокументСсылка.АР17_ЗаключениеДоговораАренды"));
	ТабРезультат.Колонки.Добавить("СуммаПоДокументам",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("ГруппаУслуг",Новый описаниеТипов("СправочникСсылка.АР_ГруппыУслуг"));
	ТабРезультат.Колонки.Добавить("ВидДоговора",Новый описаниеТипов("СправочникСсылка.АР_ВидыДоговоров"));
	ТабРезультат.Колонки.Добавить("ИмущественныйКомплекс",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	ТабРезультат.Колонки.Добавить("Контрагент",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("ДоговорКонтрагента",Новый описаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТабРезультат.Колонки.Добавить("СуммаПоДоговору",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Сумма",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("СпособНачисления",Новый описаниеТипов("СправочникСсылка.АР_СпособыНачисленияАренднойПлаты"));
	ТабРезультат.Колонки.Добавить("Ставка",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Количество",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("ДатаНачалаСрокаАренды", ОписаниеТиповД);    
	ТабРезультат.Колонки.Добавить("ДатаОкончанияСрокаАренды", ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("Отклонение",ОписаниеТиповЧ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(АР17_СчетНаАрендуСостав.Сумма) КАК СуммаПоДокументам,
	               |	АР17_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	АР17_СчетНаАрендуСостав.Номенклатура
	               |ПОМЕСТИТЬ ВТ_Счета
	               |ИЗ
	               |	Документ.АР17_СчетНаАренду.Состав КАК АР17_СчетНаАрендуСостав
	               |ГДЕ
	               |	АР17_СчетНаАрендуСостав.Ссылка.НачалоПериода <= &КонецПериода
	               |	И АР17_СчетНаАрендуСостав.Ссылка.ОкончаниеПериода >= &НачалоПериода
	               |	И АР17_СчетНаАрендуСостав.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_СчетНаАрендуСостав.Номенклатура,
	               |	АР17_СчетНаАрендуСостав.Ссылка.ДоговорКонтрагента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента,
	               |	СУММА(АР17_НачислениеАренднойПлатыСостав.Сумма) КАК СуммаПоДокументам,
	               |	АР17_НачислениеАренднойПлатыСостав.Номенклатура
	               |ПОМЕСТИТЬ ВТ_Акты
	               |ИЗ
	               |	Документ.АР17_НачислениеАренднойПлаты.Состав КАК АР17_НачислениеАренднойПлатыСостав
	               |ГДЕ
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.Проведен = ИСТИНА
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.НачалоПериода <= &КонецПериода
	               |	И АР17_НачислениеАренднойПлатыСостав.Ссылка.ОкончаниеПериода >= &НачалоПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_НачислениеАренднойПлатыСостав.Ссылка.ДоговорКонтрагента,
	               |	АР17_НачислениеАренднойПлатыСостав.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР_РасчетыПоДоговорамОбороты.Организация КАК Организация,
	               |	АР_РасчетыПоДоговорамОбороты.Контрагент,
	               |	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	               |	АР_РасчетыПоДоговорамОбороты.Период КАК Период,
	               |	АР_РасчетыПоДоговорамОбороты.Регистратор
	               |ПОМЕСТИТЬ ВТ_Дог
	               |ИЗ
	               |	РегистрНакопления.АР_РасчетыПоДоговорам.Обороты(&НачалоПериода, &КонецПериода, Запись, ) КАК АР_РасчетыПоДоговорамОбороты
	               |ГДЕ
	               |	АР_РасчетыПоДоговорамОбороты.Регистратор ССЫЛКА Документ.АР17_ПроведениеДоговораАренды
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР_РасчетыПоДоговорамОбороты.ДоговорКонтрагента,
	               |	АР_РасчетыПоДоговорамОбороты.Организация,
	               |	АР_РасчетыПоДоговорамОбороты.Контрагент,
	               |	АР_РасчетыПоДоговорамОбороты.Период,
	               |	АР_РасчетыПоДоговорамОбороты.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Дог.Регистратор.ДоговорАренды.Организация КАК Организация,
	               |	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент КАК Контрагент,
	               |	ВТ_Дог.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента
	               |ПОМЕСТИТЬ ВТ_Дог2
	               |ИЗ
	               |	ВТ_Дог КАК ВТ_Дог
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Дог.Регистратор.ДоговорКонтрагента,
	               |	ВТ_Дог.Регистратор.ДоговорАренды.Контрагент,
	               |	ВТ_Дог.Регистратор.ДоговорАренды.Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Дог2.ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Сумма,
	               |	ВТ_Дог2.Организация,
	               |	ВТ_Дог2.Контрагент,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ИК,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ВидДоговора,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ГруппаУслуг,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.СпособНачисления,
	               |	ВЫРАЗИТЬ(АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2)) КАК Ставка,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Количество,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |ПОМЕСТИТЬ ВТ_Дог3
	               |ИЗ
	               |	ВТ_Дог2 КАК ВТ_Дог2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты
	               |		ПО ВТ_Дог2.ДоговорКонтрагента = АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |	И АР17_ЗаключениеДоговораАрендыПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Дог2.ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Сумма,
	               |	ВТ_Дог2.Организация,
	               |	ВТ_Дог2.Контрагент,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ИК,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ВидДоговора,
	               |	АР17_УстановкаПараметровИКНоменклатура.ГруппаУслуг,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.СпособНачисления,
	               |	ВЫРАЗИТЬ(АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ставка КАК ЧИСЛО(15, 2)),
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Количество,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды
	               |ИЗ
	               |	ВТ_Дог2 КАК ВТ_Дог2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР17_УстановкаПараметровИКНоменклатура
	               |			ПО АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ИК = АР17_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка
	               |				И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Услуга = АР17_УстановкаПараметровИКНоменклатура.Номенклатура
	               |		ПО ВТ_Дог2.ДоговорКонтрагента = АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.Ссылка.ДоговорКонтрагента
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды <= &КонецПериода
	               |	И АР17_ЗаключениеДоговораАрендыПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды >= &НачалоПериода
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Дог2.ДоговорКонтрагента,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Услуга,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Сумма,
	               |	ВТ_Дог2.Организация,
	               |	ВТ_Дог2.Контрагент,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка.ИК,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка.ВидДоговора,
	               |	АР17_УстановкаПараметровИКНоменклатура.ГруппаУслуг,
	               |	""Ком"",
	               |	ВЫРАЗИТЬ(АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Тариф КАК ЧИСЛО(15, 2)),
	               |	NULL,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаНачалаПериода,
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаОкончанияПериода
	               |ИЗ
	               |	ВТ_Дог2 КАК ВТ_Дог2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеДоговораАренды.КоммунальныеУслуги КАК АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_УстановкаПараметровИК.Номенклатура КАК АР17_УстановкаПараметровИКНоменклатура
	               |			ПО АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка.ИК = АР17_УстановкаПараметровИКНоменклатура.Ссылка.ИКСсылка
	               |				И АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Услуга = АР17_УстановкаПараметровИКНоменклатура.Номенклатура
	               |		ПО ВТ_Дог2.ДоговорКонтрагента = АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.Ссылка.ДоговорКонтрагента
	               |ГДЕ
	               |	АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаНачалаПериода <= &КонецПериода
	               |	И АР17_ЗаключениеДоговораАрендыКоммунальныеУслуги.ДатаОкончанияПериода >= &НачалоПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Дог3.Ссылка КАК Договор,
	               |	ВЫБОР
	               |		КОГДА &ВидДокумента = ""Счета""
	               |			ТОГДА ЕСТЬNULL(ВТ_Счета.СуммаПоДокументам, 0)
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_Акты.СуммаПоДокументам, 0)
	               |	КОНЕЦ КАК СуммаПоДокументам,
	               |	ВТ_Дог3.ГруппаУслуг КАК ГруппаУслуг,
	               |	ВТ_Дог3.ВидДоговора,
	               |	ВТ_Дог3.ИК КАК ИмущественныйКомплекс,
	               |	ВТ_Дог3.Организация,
	               |	ВТ_Дог3.Контрагент,
	               |	ВТ_Дог3.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ВТ_Дог3.Сумма КАК Сумма,
	               |	ВТ_Дог3.СпособНачисления,
	               |	ВТ_Дог3.Количество,
	               |	ВТ_Дог3.ДатаНачалаСрокаАренды,
	               |	ВТ_Дог3.ДатаОкончанияСрокаАренды,
	               |	ВТ_Дог3.Ставка
	               |ПОМЕСТИТЬ ВТ_Общ
	               |ИЗ
	               |	ВТ_Дог3 КАК ВТ_Дог3
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Акты КАК ВТ_Акты
	               |		ПО ВТ_Дог3.ДоговорКонтрагента = ВТ_Акты.ДоговорКонтрагента
	               |			И ВТ_Дог3.Услуга = ВТ_Акты.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Счета КАК ВТ_Счета
	               |		ПО ВТ_Дог3.ДоговорКонтрагента = ВТ_Счета.ДоговорКонтрагента
	               |			И ВТ_Дог3.Услуга = ВТ_Счета.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Дог3.Организация,
	               |	ВТ_Дог3.Контрагент,
	               |	ВТ_Дог3.ДоговорКонтрагента,
	               |	ВТ_Дог3.Ссылка,
	               |	ВТ_Дог3.ИК,
	               |	ВТ_Дог3.ВидДоговора,
	               |	ВТ_Дог3.ГруппаУслуг,
	               |	ВТ_Дог3.СпособНачисления,
	               |	ВТ_Дог3.Количество,
	               |	ВТ_Дог3.ДатаНачалаСрокаАренды,
	               |	ВТ_Дог3.ДатаОкончанияСрокаАренды,
	               |	ВТ_Дог3.Сумма,
	               |	ВЫБОР
	               |		КОГДА &ВидДокумента = ""Счета""
	               |			ТОГДА ЕСТЬNULL(ВТ_Счета.СуммаПоДокументам, 0)
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_Акты.СуммаПоДокументам, 0)
	               |	КОНЕЦ,
	               |	ВТ_Дог3.Ставка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Общ.Договор,
	               |	ВТ_Общ.СуммаПоДокументам КАК СуммаПоДокументам,
	               |	ВТ_Общ.ГруппаУслуг,
	               |	ВТ_Общ.ВидДоговора,
	               |	ВТ_Общ.ИмущественныйКомплекс,
	               |	ВТ_Общ.Организация,
	               |	ВТ_Общ.Контрагент,
	               |	ВТ_Общ.ДоговорКонтрагента,
	               |	СУММА(ВТ_Общ.Сумма) КАК Сумма,
	               |	ВТ_Общ.СпособНачисления,
	               |	ВТ_Общ.Количество,
	               |	ВТ_Общ.ДатаНачалаСрокаАренды,
	               |	ВТ_Общ.ДатаОкончанияСрокаАренды,
	               |	ВТ_Общ.Ставка
	               |ИЗ
	               |	ВТ_Общ КАК ВТ_Общ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Общ.ДоговорКонтрагента,
	               |	ВТ_Общ.Контрагент,
	               |	ВТ_Общ.Организация,
	               |	ВТ_Общ.ИмущественныйКомплекс,
	               |	ВТ_Общ.ГруппаУслуг,
	               |	ВТ_Общ.Договор,
	               |	ВТ_Общ.ВидДоговора,
	               |	ВТ_Общ.СпособНачисления,
	               |	ВТ_Общ.Количество,
	               |	ВТ_Общ.ДатаНачалаСрокаАренды,
	               |	ВТ_Общ.ДатаОкончанияСрокаАренды,
	               |	ВТ_Общ.СуммаПоДокументам,
	               |	ВТ_Общ.Ставка";
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Настройки = КомпоновщикНастроек.Настройки; 
	
	НачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	КонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	ВидДокумента = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДокумента"));

	НачалоПериода = Дата(НачалоПериода.Значение);
	КонецПериода = Дата(КонецПериода.Значение);
	
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода(КонецПериода,"День"));
	Запрос.УстановитьПараметр("ВидДокумента",ВидДокумента.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		НовСтрока=ТабРезультат.Добавить();
		НовСтрока.Договор=РезультатЗапроса.Договор;
		НовСтрока.СуммаПоДокументам=РезультатЗапроса.СуммаПоДокументам;
		НовСтрока.ГруппаУслуг=РезультатЗапроса.ГруппаУслуг;
		НовСтрока.ВидДоговора=РезультатЗапроса.ВидДоговора;
		НовСтрока.ИмущественныйКомплекс=РезультатЗапроса.ИмущественныйКомплекс;
		НовСтрока.Организация=РезультатЗапроса.Организация;
		НовСтрока.Контрагент=РезультатЗапроса.Контрагент;
		НовСтрока.ДоговорКонтрагента=РезультатЗапроса.ДоговорКонтрагента;
		//НовСтрока.СуммаПоДоговору=РезультатЗапроса.СуммаПоДоговору;
		Если РезультатЗапроса.СпособНачисления = "Ком" Тогда
			НовСтрока.Сумма = РезультатЗапроса.Сумма;
		Иначе	
			НовСтрока.Сумма=АР_РасчитатьСумму(РезультатЗапроса.ДатаНачалаСрокаАренды,РезультатЗапроса.ДатаОкончанияСрокаАренды, НачалоПериода,КонецПериода,РезультатЗапроса.СпособНачисления,РезультатЗапроса.Ставка,РезультатЗапроса.Сумма,РезультатЗапроса.Количество,РезультатЗапроса.ДоговорКонтрагента);
		КонецЕсли;	
		НовСтрока.СпособНачисления=РезультатЗапроса.СпособНачисления;
		НовСтрока.Ставка=РезультатЗапроса.Ставка;
		НовСтрока.Количество=РезультатЗапроса.Количество;
		НовСтрока.ДатаНачалаСрокаАренды=РезультатЗапроса.ДатаНачалаСрокаАренды;
		НовСтрока.ДатаОкончанияСрокаАренды=РезультатЗапроса.ДатаОкончанияСрокаАренды;
		НовСтрока.Отклонение = 0;
	КонецЦикла;	
	
	//
	//ТабРезультат.Свернуть("Договор,ГруппаУслуг,ВидДоговора,ИмущественныйКомплекс,Организация,Контрагент,ДоговорКонтрагента,Ставка,Сумма","СуммаПоДокументам");
	ТабРезультат.Свернуть("Договор,ГруппаУслуг,ВидДоговора,ИмущественныйКомплекс,Организация,Контрагент,ДоговорКонтрагента,СуммаПоДокументам,Отклонение","Сумма");
	Для Каждого СтрТабРезультат Из ТабРезультат Цикл
		СтрТабРезультат.Отклонение = СтрТабРезультат.СуммаПоДокументам - СтрТабРезультат.Сумма;	
	КонецЦикла;	
		
    ВнешниеНаборыДанных = Новый Структура; 
    ВнешниеНаборыДанных.Вставить("РеестрДоговоров", ТабРезультат); 

	СтандартнаяОбработка = Ложь;
    
     КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
     Настройки = КомпоновщикНастроек.Настройки; 
	 
 	 ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
    ДокументРезультат.Очистить();
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
	
КонецПроцедуры

Функция АР_РасчитатьСумму(ДатаНачалаАренды,ДатаОкончанияАренды,НачалоПериода,КонецПериода,СпособНачисления,Ставка,Сумма,Количество,ДоговорКонтрагента)
	
		Сумма1=Сумма;
	
		Если СпособНачисления.ИмяПредопределенныхДанных = "Директивный" Тогда
	    	//
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "КоличестваДнейАренды" Тогда
			КоличествоДней = КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды, НачалоПериода, КонецПериода);
			Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,НачалоПериода,КонецПериода,КоличествоДней);
			Сумма1 = Сумма1/День(КонецМесяца(НачалоПериода)) * КоличествоДней;
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "КоличестваМесяцевКонтракта" Тогда
			РазницаВМесяцах = РазницаВМесяцах(НачалоПериода, КонецПериода)+1;
			Сумма1 = Сумма/РазницаВМесяцах;
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "КоличестваКалендарныхДней" Тогда
			Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,ДатаНачалаАренды,ДатаОкончанияАренды);
			КоличествоДней = КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды,ДатаНачалаАренды,ДатаОкончанияАренды);
			СтоимостьОдногоДня 	= ?(КоличествоДней=0,0,Сумма1/КоличествоДней);
			//ПериодАренды = ((КонецДня(ПериодКонец) + 1) - ПериодНачало)/86400;
			ПериодАренды = ((КонецДня(КонецПериода) + 1) - НачалоПериода)/86400;
			Сумма1 = ПериодАренды*СтоимостьОдногоДня;
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаМесяц" Тогда
			Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);
			КоличествоДней = КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(КоличествоДней=0,0,Сумма1/КоличествоДней);
			Сумма1 = СтоимостьПоКварталам(СтоимостьОдногоДня,ДатаНачалаАренды,ДатаОкончанияАренды);
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаМесяцСчетЗаКварталАктЗаКвартал" Тогда
			Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);
			КоличествоДней = КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(КоличествоДней=0,0,Сумма1/КоличествоДней);
			Сумма1 = СтоимостьПоКварталам(СтоимостьОдногоДня,ДатаНачалаАренды,ДатаОкончанияАренды);
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "СтоимостьЗаКварталСчетЗаКварталАктЗаКвартал" Тогда	
			Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);
			КоличествоДней = КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды,ДатаНачалаАренды,ДатаОкончанияАренды-60*60*24);//(СтрокаТаб.ДатаОкончанияАренды - СтрокаТаб.ДатаНачалаАренды) / 86400;
			СтоимостьОдногоДня 	= ?(КоличествоДней=0,0,Сумма1/КоличествоДней);
			Сумма1 = СтоимостьПоКварталам(СтоимостьОдногоДня,ДатаНачалаАренды,ДатаОкончанияАренды);
		ИначеЕсли СпособНачисления.ИмяПредопределенныхДанных = "В_руб_за_м2_год" Тогда
			
			Если ДоговорКонтрагента.АР_ВестиВзаиморасчетыПоПериодам Тогда
				Периодичность = ДоговорКонтрагента.АР_Периодичность;
			Иначе
				Периодичность = СпособНачисления.ПериодНачисления;
				Если Не ЗначениеЗаполнено(Периодичность) Тогда
					Периодичность = Константы.АР_ПериодНачисленияАренднойПлаты.Получить();
				КонецЕсли;
			КонецЕсли;
			ПериодАренды = НачалоПериода(НачалоПериода, Периодичность);		
			// Если периодичность больше месяца, то разобъем по месяцам
			// кроме случа Периодичность = Год и период начисления - календарный год или несколько
			Если Периодичность = Перечисления.Периодичность.Год
				И НачалоПериода = НачалоГода(НачалоПериода)
				И КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			ИначеЕсли Не (Периодичность = Перечисления.Периодичность.День ИЛИ Периодичность = Перечисления.Периодичность.Неделя) Тогда
				Периодичность = Перечисления.Периодичность.Месяц;
			КонецЕсли;
			
			//Если НачалоПериода(НачалоПериода, Периодичность) < НачалоПериода(КонецПериода, Периодичность) Тогда
				//НоваяСтрокаТаб = ДанныеУчета.Вставить(НомерСтроки + 1);
				//ЗаполнитьЗначенияСвойств(НоваяСтрокаТаб, СтрокаТаб);
				//ПериодКонец = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность);
				//НоваяСтрокаТаб.ПериодНачало = КонецПериода(СтрокаТаб.ПериодНачало, Периодичность) + 1;
				
				//Сумма1 = АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество,НачалоПериода,КонецПериода);
				Сумма1=Сумма/12;
				
			//КонецЕсли;
		
		
		КонецЕсли;
	
		Возврат Сумма1;
		
КонецФункции	

Функция СтоимостьПоКварталам(СтоимостьОдногоДня,ДатаНачалаАренды,ДатаОкончанияАренды,НачалоПериода = Неопределено, КонецПериода = Неопределено,КоличествоВремени = Неопределено)
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//НачалоПериода = Макс(СтрокаТаблицы.ДатаНачалаАренды, СтрокаТаблицы.ПериодНачало);
		НачалоПериода = ДатаНачалаАренды;
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		КонецПериода = ДатаОкончанияАренды;
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	КоличествоДней = КоличествоВремени;
	
	Месяцы = Новый СписокЗначений;
	ГодНачало = Год(НачалоПериода);
	МесяцНачало = Месяц(НачалоПериода);
	МесяцКонец = Месяц(КонецПериода);
	Сумма = 0;
	//Если (День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода)) Тогда
		Сумма = Сумма + КоличествоДней*СтоимостьОдногоДня;
	//Иначе
	//	Сумма = Сумма + СтрокаТаблицы.КоличествоДней*СтоимостьОдногоДня;
	//КонецЕсли;
	
	//Для к = МесяцНачало+1 По МесяцКонец-1 Цикл
	//	ДатаМесяца = Дата(Строка(ГодНачало), к, 1);
	//	Сумма = Сумма + День(КонецМесяца(ДатаМесяца))*СтоимостьОдногоДня;
	//КонецЦикла;	
	
	//Сумма = Сумма + (День(КонецПериода))*СтоимостьОдногоДня;
	
	Возврат Сумма;
КонецФункции	



Функция КоличествоДней(ДатаНачалаАренды,ДатаОкончанияАренды, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = ДатаНачалаАренды;
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		КонецПериода = ДатаОкончанияАренды;
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		Если ((День(НачалоМесяца(НачалоПериода)) <> День(НачалоПериода)) или (День(КонецМесяца(КонецПериода)) <> День(КонецПериода))) и День(НачалоМесяца(НачалоПериода)) <> 1 Тогда
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень; //количество дней
		Иначе
			КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень+1; //количество дней
		КонецЕсли;	
	КонецЕсли;
	
	Возврат КоличествоВремени;

КонецФункции	

Функция АР17_РассчитатьСтрокуНачисления(ДатаНачалаАренды,ДатаОкончанияАренды,СпособНачисления,Сумма,Ставка,Количество, НачалоПериода = Неопределено, КонецПериода = Неопределено, КоличествоВремени = Неопределено) Экспорт
	
	Сумма_ = Сумма;
	
	ОдинДень = 60*60*24;
	Если НачалоПериода = Неопределено Тогда
		//НачалоПериода = СтрокаТаблицы.ПериодНачало;
		НачалоПериода = ДатаНачалаАренды;
	КонецЕсли;
	Если КонецПериода = Неопределено Тогда
		//КонецПериода = Мин(СтрокаТаблицы.ДатаОкончанияАренды, СтрокаТаблицы.ПериодКонец);
		КонецПериода = ДатаОкончанияАренды;
	КонецЕсли;
	Если КоличествоВремени = Неопределено Тогда
		КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода))/ОдинДень + 1; //количество дней
	КонецЕсли;
	
	КоличествоДней = КоличествоВремени;
	КоличествоДнейВМесяце = День(КонецМесяца(НачалоПериода));
	ПериодНачисления = СпособНачисления.ПериодНачисления;
	Если ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		КоличествоВремениПриведенное = КоличествоВремени/7;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.День Тогда
		КоличествоВремениПриведенное = КоличествоВремени;
	Иначе
		Если ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
			КоличествоМесяцев = 1;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
			КоличествоМесяцев = 3;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
			КоличествоМесяцев = 6;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
			КоличествоМесяцев = 12;
		Иначе
			КоличествоМесяцев = 1;
		КонецЕсли;
			
		Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода) И 
			НачалоДня(КонецПериода) = НачалоДня(КонецМесяца(НачалоПериода)) Тогда
			КоличествоВремениПриведенное = 1/КоличествоМесяцев;
		ИначеЕсли НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода) И 
			КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			КоличествоВремениПриведенное = (Год(КонецПериода) - Год(НачалоПериода) + 1) * 12 / КоличествоМесяцев;
		Иначе
			ИспользоватьСреднийМесяц = Константы.АР_ИспользоватьСреднийМесяц.Получить();
			Если ИспользоватьСреднийМесяц Тогда
				СреднийМесяц = Константы.АР_СреднийМесяц.Получить();
				Если Не ЗначениеЗаполнено(СреднийМесяц) Тогда
					Сообщить("Не задано значение константы ""Средний месяц""!",СтатусСообщения.Важное);
					КоличествоВремениПриведенное = 0;	
				Иначе
					КоличествоВремениПриведенное = КоличествоВремени/(СреднийМесяц * КоличествоМесяцев);
				КонецЕсли;
			Иначе
				КоличествоВремениПриведенное = КоличествоВремени/(День(КонецМесяца(НачалоПериода)) * КоличествоМесяцев);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Коэффициент = КоличествоВремениПриведенное;
	
	Если Сумма_ = 0 или (ПериодНачисления = Перечисления.Периодичность.Год) Тогда //-са
		//Результат = СтавкаСпособаНачисления * Количество Коэффициент;
		Результат = Ставка * Количество * Коэффициент;
		Сумма_ = Окр(Результат, 2);
	КонецЕсли;	//-са
	
	Возврат Сумма_;
	
КонецФункции
Функция РазницаВМесяцах(ДатаНач, ДатаКон)
    Лет1 = Год(ДатаНач);
    Месяцев1 = Месяц(ДатаНач);
    Если НачалоДня(ДатаНач) <> НачалоДня(КонецМесяца(ДатаНач)) Тогда
        Дней1 = День(ДатаНач);
    Иначе
        Дней1 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли; 

    Лет2 = Год(ДатаКон);
    Месяцев2 = Месяц(ДатаКон);
    Если НачалоДня(ДатаКон) <> НачалоДня(КонецМесяца(ДатаКон)) Тогда
        Дней2 = День(ДатаКон);
    Иначе
        Дней2 = 30;//В каждом месяце ровно 30 дней
    КонецЕсли;     

    Лет = Лет2 - Лет1;
    Месяцев = Месяцев2 - Месяцев1;
    Дней = Дней2 - Дней1;
    Возврат Цел(Лет*12 + Месяцев + Дней/30);
КонецФункции

Функция НачалоПериода(Дата, Периодичность) Экспорт 
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат НачалоДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат НачалоНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат НачалоМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат НачалоКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат НачалоГода(Дата);
	Иначе
		Возврат НачалоДня(Дата);
	КонецЕсли;	
	
КонецФункции

Функция КонецПериода(Дата, Периодичность) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.День Тогда
		Возврат КонецДня(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат КонецНедели(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат КонецМесяца(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат КонецКвартала(Дата);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат КонецГода(Дата);
	Иначе
		Возврат КонецДня(Дата);
	КонецЕсли;	
	
КонецФункции
